src/cf/src/Reports/ПростоиСтанков/ПростоиСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПростоиСтанков</name>
</mdclass:Report>

src/cf/src/InformationRegisters/ЗагрузкаСтанков/ЗагрузкаСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗагрузкаСтанков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидыЗагрузкиСтанков</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыЗагрузкиСтанков/ВидыЗагрузкиСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗагрузкиСтанков</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ОбслуживаниеСтанка/ОбслуживаниеСтанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеСтанка</name>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <type>
      <types>EnumRef.ВидыОбслуживанияСтанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Плановое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Reports/ПростоиСтанков/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Данные отчёта «Простои станков» одной таблицей - внешний набор «Простои» схемы. В таблице строки простоев
// (обслуживание станков, пересёкшееся с периодом) и по строке фонда времени на станок: фонд не выражается
// запросом (режим работы по дням недели и производственный календарь), а связанный набор задвоил бы его в
// итогах по видам и причинам. Отчёт и тест зовут эту функцию одинаково.
//
// Параметры:
//  Период       - СтандартныйПериод - период отчёта
//  ВключатьПлан - Булево - брать и запланированное обслуживание
//
// Возвращаемое значение:
//  Структура:
//   * Простои        - ТаблицаЗначений - колонки полей набора схемы
//   * Предупреждение - Строка - текст о незаполненном производственном календаре, пустой - всё в порядке
//
Функция ДанныеОтчета(Период, ВключатьПлан) Экспорт

	Начало = Период.ДатаНачала;
	Окончание = Период.ДатаОкончания;
	Если Не ЗначениеЗаполнено(Окончание) Тогда
		Окончание = КонецМесяца(?(ЗначениеЗаполнено(Начало), Начало, ТекущаяДатаСеанса()));
	КонецЕсли;
	// Период без начала обошёл бы фондом все дни с 0001 года: берётся месяц окончания.
	Если Не ЗначениеЗаполнено(Начало) Тогда
		Начало = НачалоМесяца(Окончание);
	КонецЕсли;
	// Интервалы полуоткрытые: последняя секунда периода входит в него.
	Окончание = Окончание + 1;

	Простои = НоваяТаблицаДанных();
	Записи = ЗаписиОбслуживания(Начало, Окончание, ВключатьПлан);
	Станки = СтанкиОтчета(Записи);
	Интервалы = ЗагрузкаСтанков.ИнтервалыРаботыСтанков(Станки, Начало, Окончание);

	Для Каждого Запись Из Записи Цикл
		ИнтервалС = Макс(Запись.Начало, Начало);
		ИнтервалПо = Мин(Запись.Окончание, Окончание);
		Строка = Простои.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Запись);
		Строка.Часы = ЗагрузкаСтанков.ЧасыМеждуДатами(ИнтервалС, ИнтервалПо);
		ИнтервалыСтанка = Интервалы.НайтиСтроки(ОтборСтанка(Запись.Станок));
		Строка.ЧасыВРабочееВремя = ЗагрузкаСтанков.ОкруглитьЧасы(
			ЗагрузкаСтанков.ЧасыВРабочееВремя(ИнтервалыСтанка, ИнтервалС, ИнтервалПо));
		Строка.Случаев = 1;
	КонецЦикла;
	Для Каждого Станок Из Станки Цикл
		Строка = Простои.Добавить();
		Строка.Станок = Станок;
		ИнтервалыСтанка = Интервалы.НайтиСтроки(ОтборСтанка(Станок));
		Строка.Фонд = ЗагрузкаСтанков.ОкруглитьЧасы(ЗагрузкаСтанков.ЧасыИнтервалов(ИнтервалыСтанка));
	КонецЦикла;

	Предупреждение = ЗагрузкаСтанков.ТекстПустогоКалендаря(Станки, Начало, Окончание);
	Возврат Новый Структура("Простои, Предупреждение", Простои, Предупреждение);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписиОбслуживания(Начало, Окончание, ВключатьПлан)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Загрузка.Станок КАК Станок,
	|	Загрузка.Начало КАК Начало,
	|	Загрузка.Окончание КАК Окончание,
	|	Загрузка.План КАК Плановое,
	|	Загрузка.Регистратор КАК Документ,
	|	Обслуживание.ВидОбслуживания КАК ВидОбслуживания,
	|	Обслуживание.Причина КАК Причина
	|ИЗ
	|	РегистрСведений.ЗагрузкаСтанков КАК Загрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбслуживаниеСтанка КАК Обслуживание
	|		ПО Загрузка.Регистратор = Обслуживание.Ссылка
	|ГДЕ
	|	Загрузка.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидыЗагрузкиСтанков.Обслуживание)
	|	И Загрузка.Начало < &Окончание
	|	И Загрузка.Окончание > &Начало
	|	И &УсловиеПлана
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начало";
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Окончание", Окончание);
	Если Не ВключатьПлан Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПлана", "НЕ Загрузка.План");
	КонецЕсли;
	Запрос.УстановитьПараметр("УсловиеПлана", Истина);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Станки отчёта: все действующие и выведенные, у которых в периоде были простои.
//
// Параметры:
//  Записи - ТаблицаЗначений - записи обслуживания периода
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ПроизводственноеОборудование
//
Функция СтанкиОтчета(Записи)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Станки.Ссылка КАК Станок
	|ИЗ
	|	Справочник.ПроизводственноеОборудование КАК Станки
	|ГДЕ
	|	НЕ Станки.ПометкаУдаления
	|	И НЕ Станки.Выведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Станки.Наименование";
	Колонка = "Станок";
	Станки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(Колонка);
	Для Каждого Станок Из Записи.ВыгрузитьКолонку(Колонка) Цикл
		Если Станки.Найти(Станок) = Неопределено Тогда
			Станки.Добавить(Станок);
		КонецЕсли;
	КонецЦикла;
	Возврат Станки;

КонецФункции

Функция ОтборСтанка(Станок)

	Возврат Новый Структура("Станок", Станок);

КонецФункции

Функция НоваяТаблицаДанных()

	// Типы - из метаданных: часы как в регистре загрузки, причина как в документе.
	ТипЧисла = Метаданные.РегистрыСведений.ЗагрузкаСтанков.Ресурсы.Часы.Тип;
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Станок", Новый ОписаниеТипов("СправочникСсылка.ПроизводственноеОборудование"));
	Таблица.Колонки.Добавить("ВидОбслуживания", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОбслуживанияСтанков"));
	Таблица.Колонки.Добавить("Причина", Метаданные.Документы.ОбслуживаниеСтанка.Реквизиты.Причина.Тип);
	Таблица.Колонки.Добавить("Плановое", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.ОбслуживаниеСтанка"));
	Таблица.Колонки.Добавить("Часы", ТипЧисла);
	Таблица.Колонки.Добавить("ЧасыВРабочееВремя", ТипЧисла);
	Таблица.Колонки.Добавить("Случаев", ТипЧисла);
	Таблица.Колонки.Добавить("Фонд", ТипЧисла);
	Возврат Таблица;

КонецФункции

#КонецОбласти
